{
    "speaker" : "Dr. Hemant  Darbari",
    "speaker_designation" : "(Mission Director, National Supercomputing Mission)",
    "title" : "Research progress in Superconductivity",
    "date" : "Friday 15 September 2023 ",
    "time" : "16:00",
    "venue" : "ONLINE \nhttps://zoom.us/j/91427966752",
    "abstract" : "Main thrust in the National Supercomputing Mission (NSM) is to provide the Supercomputing Infrastructure of varying compute capacities to the Academia, Researchers, MSMEs and Start-ups for meeting their compute needs and to create the capability of Design and Manufacturing of the Supercomputers indigenously in India, under the Make-in-India initiative of the Government of India. C-DAC has been entrusted with the responsibility to design, develop, and deploy Supercomputing systems under NSM. \n\nAs part of NSM, C-DAC has built indigenous Supercomputing ecosystem in a phased manner, which has led to indigenously designed and manufactured Supercomputers. Now in NSM 2.0 we have planned to establish Pre-exa/Exa-Scale Supercomputing eco-system comprising of HPC Microprocessors; HPC Servers with Multiple Architectures; High Speed Network Interconnects; Storage Systems; System Software Stack, HPC Systems and even integration of HPC with Quantum Accelerators. It is envisaged to facilitate solving Grand Challenge problems with the thus developed ecosystem. National Engineer's Day Commemorative Special ASET Colloquium. \n\nAbout the Speaker: \nDr Hemant Darbari is the Mission Director of the National Super Computing Mission in India. He is an alumnus of IIT-Roorkee & University of Allahabad. He is a founding member of the Centre for Development of Advanced Computing (C-DAC) and before taking over the current assignment he was the Director General of C-DAC. He has as vast experience of more than three decades in the areas of Artificial Intelligence, Machine Translation, and High Performance Computing (HPC). As a Director General, C-DAC he was responsible for building capacity and capability for R&D in the multi-specialty domains of HPC, Multilingual Computing, Software Technologies, Health Informatics, Disaster management, e-Governance and Education & Training. He has also designed, developed, and executed very large projects of National Importance. \n\nHe is recipient of the prestigious 'Computerworld Smithsonian Award Medal' for his work on MANTRA-: A Machine assisted Translation tool and 'VASVIK Award' for his contributions to the advancement of Information and Communication Technologies. He has also received the 'Award of Excellence in Corporate Leadership' at IIPS-2015 and the 'Vishwa Hindi Samman' for his contribution in the field of Hindi Language Computing, Research, and Development."
}